Tekla.Structures.CatalogInternal.ShapeInsertResult
The result of the insert function.

Tekla.Structures.CatalogInternal.ShapeInsertResult.NoResult
Insert failed.

Tekla.Structures.CatalogInternal.ShapeInsertResult.Ok
Insert succeeded.

Tekla.Structures.CatalogInternal.ShapeInsertResult.SystemFail
Insert failed due to system problems like insufficient disk or memory

Tekla.Structures.CatalogInternal.ShapeInsertResult.GeometryMissing
Geometry fatal error, polymesh not set to shape or polymesh empty

Tekla.Structures.CatalogInternal.ShapeInsertResult.HashMissing
The geometry hash value has not been calculated amd set into the input

Tekla.Structures.CatalogInternal.ShapeInsertResult.UpAxisMissing
The up axis is missing from the input.

Tekla.Structures.CatalogInternal.ShapeInsertResult.NameError
The shape name already exists in insert or does nto exist in modify.

Tekla.Structures.CatalogInternal.ShapeInsertResult.BrepExists
The geometry exists in shape catalog.

Tekla.Structures.CatalogInternal.ShapeInsertResult.StoringFailed
Adding the shape into the BRep storage failed

Tekla.Structures.CatalogInternal.ShapeInsertResult.SolidCleanFailed
Cleaning the solid created from polymesh failed, this is different from non-solidity